# Exporter IFC Get Family Instance Assembly Offset Method

Source: https://www.revitapidocs.com/2026/14122a4d-1aa3-36ff-f781-8617cf06a8dd.htm

---

| Exporter IFC Get Family Instance Assembly Offset Method |
| --- |

Obtains Translation to adjust Family Instance within an Assembly, based on Family Symbol origin change.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public XYZ GetFamilyInstanceAssemblyOffset(
	FamilyInstance familyInstance
)
```

```
Public Function GetFamilyInstanceAssemblyOffset (
	familyInstance As FamilyInstance
) As XYZ
```

```
public:
XYZ^ GetFamilyInstanceAssemblyOffset(
	FamilyInstance^ familyInstance
)
```

```
member GetFamilyInstanceAssemblyOffset :
        familyInstance : FamilyInstance -> XYZ
```

#### Parameters

familyInstance FamilyInstance
:   The family instance.

#### Return Value

XYZ
Translation for Family Instance. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ExporterIFC Class Autodesk.Revit.DB.IFC Namespace